{
   "experience":[

      {
         "year":"2018",
         "imageUrls": [
            "https://static.wixstatic.com/media/07fea2_a57fa1a17ef74bd3a507aff95784ce21~mv2.png",
            "https://static.wixstatic.com/media/07fea2_cb997d0085734a46a984183a5f8883f7~mv2.png",
            "https://static.wixstatic.com/media/07fea2_8d517f540aa8455aae76ddea0e4b15f0~mv2.png"
         ],
         "description":"In 2018, I received a prestigious decoration for my achievements in computer science and robotics. Two standout projects led to this recognition. The first involved constructing a Mars Rover-inspired rover with a versatile arm controlled by a mobile app. This rover showcased precise object manipulation skills during successful navigation and exploration. The second project centered around a prosthetic-like robotic hand. Utilizing Arduino and a mobile app, I developed an advanced mechanism for natural open and close movements. The aim was to empower individuals with limb impairments, granting dexterity and independence through intuitive app-controlled gestures. These groundbreaking projects earned me accolades in the field."
      },
      {
         "year":"2019",
         "imageUrls": [
            "https://static.wixstatic.com/media/07fea2_1404815eecf14839bc32d0f61f43818d~mv2.png",
            "https://static.wixstatic.com/media/07fea2_a2b35fe9dc5f4a77a618f0a718d91747~mv2.png",
            "https://static.wixstatic.com/media/07fea2_061ca101c49f4798bc51c9881a8ad225~mv2.jpg"
         ],
         "description":"In 2019, I began my studies in System Engineering with a scholarship, propelling me into the world of computer systems and engineering principles. My dedication paid off as I received a prestigious decoration for my outstanding academic performance, showcasing my hard work and commitment.\n\nAdditionally, I had the privilege of joining ACM, a renowned research hub for coding marathons. This invaluable experience allowed me to engage with like-minded individuals, participate in cutting-edge research, and sharpen my problem-solving skills through coding competitions. ACM kept me at the forefront of technological advancements in computer science.",
         "links": [
            "https://github.com/Sebas102507/taller1_gestion_de_datos",
            "https://firebasestorage.googleapis.com/v0/b/mywebpage-f159c.appspot.com/o/Rubik's%20Cube%20Deep%20Q-Network%2FScreenshot%202023-06-20%20at%203.02.04%20PM.png?alt=media&token=cc36aa51-c326-48b3-8f65-0c34dfd1910a",
            "https://firebasestorage.googleapis.com/v0/b/mywebpage-f159c.appspot.com/o/Rubik's%20Cube%20Deep%20Q-Network%2FScreenshot%202023-06-20%20at%203.05.50%20PM.png?alt=media&token=a1fb2534-9068-42eb-b0d4-472983571b9c"
         ]
      },
      {
         "year":"2020",
         "imageUrls": [
            "https://static.wixstatic.com/media/07fea2_00ddd98aed684fdc92b3050f3db02b28~mv2.jpg",
            "https://static.wixstatic.com/media/07fea2_1c02201625a24b1c9b0cc814116d4110~mv2.jpg",
            "https://static.wixstatic.com/media/07fea2_b93531d474554fc8925158b4b7edb22f~mv2.jpg"
         ],
         "description":"In 2020, I launched Fluppy, a pet-focused startup offering products and services for dog and cat owners. Despite the pandemic, the app gained around 1000 downloads on iOS and Android platforms. However, economic challenges led to the closure of the project. We then sold the app's code to a foreign company. Additionally, I achieved success at the Javeriana Territorio Emprendedor entrepreneurship camp, winning first place for my innovative business model. This recognition reinforced the potential and impact of my entrepreneurial endeavors."
      },

      {
         "year":"2021",
         "imageUrls": [
            "https://static.wixstatic.com/media/07fea2_2d167f0ec3f541eea2d0479c503b3c76~mv2.png",
            "https://static.wixstatic.com/media/07fea2_141ef370a0f24aa4ac9d5ad0e6d76b8f~mv2.jpg",
            "https://static.wixstatic.com/media/07fea2_a1448348a1e1418d9def612e4ee1574f~mv2.jpg"
         ],
         "description":"In 2021, I embarked on a journey to study Mandarin, driven by the recognition of China's growing significance in the global economy and technology. I dedicated myself to Mandarin language classes, immersing myself in learning its grammar, vocabulary, and pronunciation. My goal was to gain a profound understanding of Chinese culture, history, and society. I believed that fluency in Mandarin would not only provide me with new opportunities but also enhance cross-cultural communication and enable professional collaborations in our interconnected world."
      },

      {
         "year":"2022",
         "imageUrls": [
            "https://static.wixstatic.com/media/07fea2_8620b69f67e4442ea266afc3a40e46ba~mv2.png",
            "https://static.wixstatic.com/media/07fea2_d43e86ed58ca4d28a8ffe0ed28756ddb~mv2.jpg",
            "https://static.wixstatic.com/media/07fea2_0ebc72304e114ceeb896655ce0019cb6~mv2.png"
         ],
         "description":"In 2022, I advanced my research and data science career by participating in Sekia, a research hub at Pontificia Universidad Javeriana. Engaging in Data Science and AI projects, I contributed to research, delivered lectures on data analytics, and completed a 6-month course on forecasting with R at Boston College. Alongside my academic pursuits, I gained practical experience as a Data Analyst with JRS, extracting insights from data for informed decision-making. I also explored topics in Artificial Intelligence and focused on Machine Learning and Data Management for my master's degree. Additionally, I began a new role as a Data Engineer for Pontificia Universidad Javeriana's research vice-presidency, designing and implementing an ETL process to organize and transfer research project data to the cloud."
      },

      {
         "year":"2023",
         "imageUrls": [
            "https://static.wixstatic.com/media/07fea2_9028da593f4c4faab6ca106a4081fc2b~mv2.png",
            "https://static.wixstatic.com/media/07fea2_166340ae4d154d188430e03799e8d756~mv2.png",
            "https://static.wixstatic.com/media/07fea2_64e0e8d9e5c648a0b6af2de7bc2badb5~mv2.png"
         ],
         "description":"In 2023, I achieved notable milestones. My thesis work received an honorable mention for combining medicine, AI, and microservices. I launched Litine, a successful startup connecting medical cannabis stores with consumers, and showcased it at StartCo. I also explored AI and cryptocurrencies during a visit to the University of Cincinnati, engaging with leading engineers. Pursuing a master's in AI, I delved into deep learning, studying neural networks, CNNs, RNNs, diffusion models, attention models, transformers, and reinforcement learning. It was a transformative year of recognition, entrepreneurship, industry exposure, and academic growth."
      }


   ]
}